Андрей едет из пункта A в пункт B на автомобиле. Расстояние между этими пунктами равно NN километров. Известно, что с полным баком автомобиль способен проехать kk километров. Дана карта, на которой отмечены координаты бензоколонок, относительно пункта A. Определите минимальное число заправок, которые придется сделать Андрею, чтобы успешно достичь пункта B. Известно, что при выезде из пункта A бак был полон.

В первой строке вводятся числа NN и kk (натуральные, не превосходят 1000). В следующей строке вводится количество бензоколонок SS, потом следует SS натуральных чисел, не превосходящих NN – расстояния от пункта A до каждой заправки. Заправки упорядочены по удаленности от пункта A.

Если при данных условиях пункта B достичь невозможно, то вывести число -1−1. Если решение существует, то вывести минимальное количество остановок на дозаправку, которое нужно чтобы достичь пункта B.


https://informatics.msk.ru/mod/statements/view.php?chapterid=113075#1

    n,k = map(int,input().split())
    a = list(map(int, input().split()))
    s = a[0]
    a[0] = 0
    a.append(n)
    rast = k
    car = 0
    i = 0
    while i < len(a)-1:
        rast = k
    while (i < len(a)-1) and (rast >= a[i+1]-a[i]):
        rast -= a[i+1]-a[i]
    i += 1
    if rast == k:
        print(-1)
        return
    if i != len(a)-1:
        car += 1
        print(car)