---
permalink: "/stepik-basics-of-combinatorics/module_2_1-k-permutations-of-n-elements"
layout: page
title: "2.1 k-перестановки из n элементов"
description: Основы перечислительной комбиаторики
category: stepik-basics-of-combinatorics
importance: 1
giscus_comments: true
toc:
  sidebar: right
---

[2.1 k-перестановки из n элементов](https://stepik.org/lesson/9482/step/1?unit=3086)

### модуль 2.1 шаг 4

---

Сколько чисел, меньших миллиона, можно записать с помощью цифр 8 и/или 9?

**Решение**

\* 1 однако у нас 8 | 9  =   2^1 = 2
** -  2^2
*** - 2^3 = 8
****  -  2^4 = 16
*****  - 2^5 = 32
****** - 2^6 = 64   складываем = 126

**Ответ**

126

### модуль 2.1 шаг 5

---

На перекрестке имеется 6 светофоров. Сколько существует различных состояний этих светофоров, если каждый из них независимо от других имеет три возможных состояния — горит красный, горит желтый или горит зеленый?

**Решение**

$$ 3^6$$ - количество перестановок с повторениями

**Ответ**

729

### модуль 2.1 шаг 6

---

Сколько существует шестизначных чисел, все цифры которых имеют одинаковую четность?

Например, в числе 222222 все цифры четные.

**Решение**

множество четных {0,2,4,6,8}

множество нечетных {1,3,5,7,9}

количество элементов по 5

свободных позиций 6 _ _ _ _ _ _ , количество размещений для каждого множества $$ 5^5=3125$$

число шестизначное, не может начинаться с нуля, количество элементов начинающихся на ноль $$ 5^6-5^5=3125$$

от четных размещений отнимаем числа, которые начинаются на ноль $$ 5^6-5^5=12500$$

число размещений для нечетного множества $$ 5^6=15625$$

Результат: 15625+12500=28125 или

$$ 2∗5^6−5^5 $$  сумма возможных размещений для четного и нечетного множества минус количество чисел начинающихся на ноль

**Ответ**

28125


### модуль 2.1 шаг 8

---

Сколько существует трехзначных чисел в пятеричной системе счисления, в которых все три цифры различны?

**Решение**

Находим количество 3-перестановок из 5 цифр (от 0 до 4) и вычитаем из него количество 2-перестановок с фиксированным первым нулём из 4 цифр (от 1 до 4). Получаем:

$$
\frac{5!}{(5-3)!}-\frac{4!}{(4-2)!}=48

$$

**Ответ**

48


### модуль 2.1 шаг 9

---

Cколько существует восьмизначных чисел в пятеричной системе счисления, в которых все цифры различны?

**Решение**

в пятеричной СС множество допустимых цифр: 0, 1, 2, 3, 4 их всего пять,

по условию все цифры должны быть различны, а его длина (_ _ _ _ _ _ _ _) восемь **разных **чисел.

Ответ нет такого числа для пятеричной СС

**Ответ**

0

### модуль 2.1 шаг 10

---

В алфавите племени Бум-Бум всего шесть букв. Словом у них называется любая последовательность из шести букв, в которой есть хотя бы две одинаковые буквы. Сколько слов в языке Бум-Бум?

**Решение**

$$
6^6 - 6! = 46565  -  6! = 45936

$$

**Ответ**

45936


### модуль 2.1 шаг 11

---

Ребенок раскладывает в ряд разноцветные карточки с буквами "А", "А", "А", "А", "А", "Е", "Е", "Г", "Л", "М", "М", "П", "П", "Р", "Т", "Т". Во скольких вариантах получится слово "ТЕЛЕГАММААППАРАТ"?

**Решение**

$$
120 * 16  = 5! \cdot{ 2^4}

$$

**Ответ**

1920


### модуль 2.1 шаг 12

---

Нужно сгенерировать все возможные k-перестановки n-элементов без повторений.

Формат входные данные:
Два числа n и k через пробел. Для них гарантированно выполняется условие: $$ 0<k\leqslant{n}$$.

Формат выходных данных:
Необходимое число лексикографически упорядоченных строк, в каждой из которых содержится *k* чисел от 0 до *n-1*, разделенных пробелом.

**Sample Input:**

```
4 2
```

**Sample Output:**

```
0 1
0 2
0 3
1 0
1 2
1 3
2 0
2 1
2 3
3 0
3 1
3 2
```


**Решение**

```python
from itertools import *
input_text = input().split()
k = int(input_text[0])
n = int(input_text[1])


it = []
for i in range(0, k):
    it.append(i)

from itertools import product 
for roll in permutations(it, n): 
    print(*roll, sep=' ')
  
```

**Ответ**

Программа python
